COS 284/Notes/ISA.html
<!doctype html>
<html lang="en">
<head>
<title>Fundamental Concepts and ISA</title>
<!-- 2016-10-09 Sun 09:44 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Regan">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">
</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-9"><h1 class="title">Fundamental Concepts and ISA</h1>


<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why Study Computer Architecture?</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>Learn about how computers work and how they are designed
</li>
<li>Creating computing systems that satify goals.
</li>
<li>How have these goals changed?
</li>
</ul>

<p>
It is okay not to know something, you don't know most things.
Read <b>Gordon Moore's</b> seminal paper.
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Today is a critical time for computer architecture</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<b>20 years ago there was one architecture that most people agreed on.</b>
</p>

<p>
This is not the case of today.
</p>

<p>
There is a massive paradigm shift to multicorea processors, there
is currently no optimal solutions. Dynamically reconfigurable 
architecures.
</p>

<p>
Out-order execution allow for massively parallized executions,
accross multiple cores. "Paging" instructions. Power and energy
has become increasingly more important (because of mobile devices).
</p>

<p>
Smaller DRAM requires more frequent updates. Take advantage of user
level perception and requirements. 
</p>

<p>
Computation becomes faster, and this effectively makes the cost of 
access to memory higher, since this speed generally stays constent.
Memory is becoming a bigger cost.
</p>

<p>
Not every problem is parallizable (or is it?). Implicit destinations.
The structure of scientific revolutions. Pre-paradigm
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Understanding Fundamentals</h2>
<div class="outline-text-2" id="text-2">
<p>
"<i>One can only change the world once one understands it.</i>"
</p>

<p>
A computer system is fundamentally made of the following three
components.
</p>

<p>
<span class="underline">Computation</span>
</p>

<p>
How do we calculate things?
</p>

<p>
<span class="underline">Communication</span>
</p>

<p>
How do subcomponents talk to one another and collaborate?
</p>

<p>
<span class="underline">Storage (memory)</span>
</p>

<p>
How do we make short term and long term persistence happen?
</p>
</div>

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> The von Neumann Computer Architecture</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>Stored program in memory
<ul class="org-ul">
<li>Linear array in terms of memory.
</li>
<li>Interpretation of stored value depends on context in cycle.
</li>
</ul>
</li>

<li>Sequential instruction processing
<ul class="org-ul">
<li>only one instruction is processed at a time, and you keep 
going. "Instruction pointer".
</li>
</ul>
</li>
</ul>

<p>
The instruction processing cycle.
</p>
<ul class="org-ul">
<li>Fetch 
</li>
<li>Decode
</li>
<li>Evaluate operands
</li>
<li>Fetch operands
</li>
<li>Execute
</li>
<li>Store (result)
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> The Dataflow Model</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Instructions execute when operands are loaded, rather than when
the program counter points to it. No program counter.
</p>

<p>
Processor keeps track of dependencies. There is no sequential
constraint, since dependencies may be one to many and many to
one. Read more about this. Data flow graphs. Is a pull model.
</p>

<p>
Are humans sequential? Von Neumann offers precise state.
</p>
</div>

<div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Barrier Synchronization</h4>
<div class="outline-text-4" id="text-2-2-1">
<p>
Different threads of control that we want to synchronise at
some point.
</p>

<p>
Say we have a book, we want to count the number of certain
letters in the book. You can have a separate thread for each
letter. Alternatively you can allocate a page to each thread.
</p>

<p>
We want some <b>massive synchronization point</b>. The dataflow 
model exposes more parallels, but very complex to design.
The problem is maintaining states.
</p>

<p>
<code>A preliminary architecture for a basic data-flow processor.</code>
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> ISA vs Microarchitecture</h3>
<div class="outline-text-3" id="text-2-3">
<p>
A car has an interface to the driver.
</p>
<ul class="org-ul">
<li>Pedal accelerates
</li>
<li>Wheel steers.
</li>
</ul>

<p>
As drivers we do not know the difference between cars. Think
of add instruction, versus the implementation of a full adder.
</p>
</div>
</div>
</div>
</div><div class="col-md-3"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Why Study Computer Architecture?</a>
<ul class="nav">
<li><a href="#sec-1-1">1.1. Today is a critical time for computer architecture</a></li>
</ul>
</li>
<li><a href="#sec-2">2. Understanding Fundamentals</a>
<ul class="nav">
<li><a href="#sec-2-1">2.1. The von Neumann Computer Architecture</a></li>
<li><a href="#sec-2-2">2.2. The Dataflow Model</a></li>
<li><a href="#sec-2-3">2.3. ISA vs Microarchitecture</a></li>
</ul>
</li>
</ul>
</div>
</nav>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Regan</p>
<p class="date">Created: 2016-10-09 Sun 09:44</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org-mode</a> 8.3.6)</p>
</div>
</footer>
</body>
</html>